src/cf/Enums/CryptographySignatureTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>CryptographySignatureTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NormalCMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BasicCAdESBES</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithTimeCAdEST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithCompleteValidationDataReferencesCAdESC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXLong</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXType1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXType2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXLongType1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExtendedLongCAdESXLongType2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESAv2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ArchivalCAdESAv3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotDefined</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/CryptographySignatureTypes/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	StandardProcessing = False;
	ValueList = New ValueList;
	ValueList.Add(Enums.CryptographySignatureTypes.BasicCAdESBES);
	ValueList.Add(Enums.CryptographySignatureTypes.WithTimeCAdEST);
	ValueList.Add(Enums.CryptographySignatureTypes.ArchivalCAdESAv3);
	
	ChoiceData = ValueList;
	
EndProcedure

#EndRegion

#EndIf
